Repository: Saiglor/ChatBroSSO
Catalog: public/locales/*/app.po
Languages: ru_ru

source: en
ru_ru: ru

source: Guest
ru_ru: Гость

source: Exit
ru_ru: Выход

source: Sample program ChatBro
ru_ru: Пример использования ChatBro

source: Single Sign-On
ru_ru: Пример прозрачной аутентификации

source: Sign In
ru_ru: Вход

source: Login
ru_ru: Логин

source: Permission to ban users
ru_ru: Возможность банить пользователей

source: Permission to delete messages
ru_ru: Возможность удалять сообщения

source: Next
ru_ru: Далее

source: How is this page implemented on node.js
ru_ru: Как реализована эта страница на node.js

source: You are a guest now. Try type to the chat and see an offer go via the social network or go with a temporary name. If you logged into the account on chatbro.com, you will be displayed under your personale name.
ru_ru: Сейчас вы гость. Попробуйте написать в чат и увидите предложение зайти через соц. сети или с временным именем. Но если вы заходили в аккаунт на chatbro.com, то будете отображаться под своим именем.

source: Code snippet
ru_ru: Фрагмент кода

source: The secret key specified in your account on chatbto.com
ru_ru: Секретный ключ указанный в личном кабинете на chatbto.com

source: Calculate the hash and pass parameters on the layout
ru_ru: Рассчитываем хеш и передаем параметры на разметку

source: The unique chat identificator
ru_ru: Уникальный идентификатор чата

source: Welcome
ru_ru: Добро пожаловать

source: Now your nickname will be used in the chat. If select the relevant paragraphs, it is possible to delete posts or ban users by clicking on the chat menu.
ru_ru: Теперь ваш ник используется в чате. Если выбраны соответствующие пункты, то можно удалять сообщения или банить пользователей, нажав на меню чата.

source: Declare variables
ru_ru: Объявляем переменные

source: Chat domain
ru_ru: Домен, на котором установлен чат

source: The secret key from the site
ru_ru: Секретный ключ, полученный на сайте

source: Your site user id
ru_ru: Id пользователя на сайте установившем чат

source: For example, use random
ru_ru: Для примера используем рандом

source: User name
ru_ru: Имя пользователя на сайте, установившем чат

source: User avatar url
ru_ru: Url аватара пользователя на сайте, установившем чат

source: User profile url
ru_ru: Ссылка на профиль пользователя на сайте, установившем чат

source: Relative reference to the profile
ru_ru: Относительная ссылка до профиля

source: An array of allowed moderation methods
ru_ru: Массив допустимых методов модерации

source: Read data from the first window
ru_ru: Считываем данные из первого окна

source: 'action' of the form
ru_ru: 'action' формы

source: the input field name
ru_ru: поле ввода имени

source: checkbox with options 'ban'
ru_ru: checkbox с опцией бана

source: checkbox with options delete message
ru_ru: checkbox с опцией удаления сообщения

source: Get string of allowed moderation methods and calculate the hash
ru_ru: Получим строку методов модераций и рассчитаем хеш

source: Options available: 'bandelete', 'ban' or 'delete'
ru_ru: Доступные варианты: 'bandelete', 'ban' или 'delete'

source: Profile
ru_ru: Профиль

source: Name
ru_ru: Имя

source: Permissions
ru_ru: Разрешения
